package com.javarush.test.level03.lesson06.task01;

/* Мама мыла раму
Вывести на экран все возможные комбинации слов «Мама», «Мыла», «Раму».
Подсказка: их 6 штук. Каждую комбинацию вывести с новой строки. Слова не разделять. Пример:
МылаРамуМама
РамуМамаМыла
...
*/

public class Solution
{
    public static void main(String[] args)
    {
        /*String a="Мама";
        String b="Мыла";
        String c ="Раму";

        for(int k=0;k<6;k++){
            System.out.println();
        }*/

        //напишите тут ваш код
        String[] text ={"Мама", "Мыла", "Раму"};
        int n = text.length;
        for (int i1 = 0; i1 < n; i1++) {

            for (int i2 = 0; i2 < n; i2++) {

                for (int i3 = 0; i3 < n; i3++) {

                    if (i1!=i2&i1!=i3&i2!=i3)

                        System.out.println(text[i1]+text[i2]+text[i3]);
                }
            }
        }

    }
}